_posts/2014-05-13-Using-org-ref-for-citations-and-references.html
---
title: Using org-ref for citations and references
date: 2014/05/13 11:25:24
updated: 2014/05/13 11:25:24
categories: org-mode,emacs
tags: 
---



<p>
<a href="https://github.com/jkitchin/jmax/blob/master/org-ref.org">org-ref</a> is an emacs-lisp module to handle bibliographic citations, and references to figures, tables and sections in org-mode. It was written first for use in org-mode, and for reasonable export to LaTeX. It does not work well for any other export (eg HTML) for now. The goal of org-ref is to make it easy to add citations, and that the citations be useful, clickable links. Below, I illustrate some of those features.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Installation</h2>
<div class="outline-text-2" id="text-1">
<p>
You can get the source here: <a href="https://github.com/jkitchin/jmax/blob/master/org-ref.org">https://github.com/jkitchin/jmax/blob/master/org-ref.org</a> . This is an org-mode file, and you can load it with
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(org-babel-load-file "org-ref.org")
</pre>
</div>

<p>
That should be all you need for basic usage.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Basic usage for citations</h2>
<div class="outline-text-2" id="text-2">
<p>
org-ref was written with bibtex in mind. We will discuss customization to use biblatex later.
</p>

<p>
The first thing you should do is add a <pre>bibliography</pre> link to your document. This link is usually put at the end of the document, where you want the bibliography to be printed in a LaTeX export. Use the filename of the bibliography with its extension in the link, and you can use multiple files if they are separated by commas. The bibliography link is clickable, and it will open the bibliography that you clicked on. Depending on the LaTeX class you are exporting to, you may also need to set a bibliographystye.
</p>

<p>
Out of the box, org-ref binds the key "C-c ]" to insert a citation. That key runs the command org-ref-insert-cite-link, which will prompt you for a regular expression to search your bibliographies for. The search is done using reftex, so you can mark several entries at once, and they will be added as a citation link. The actual kind of link used is dependent on the value of org-ref-default-citation-link, which defaults to cite. 
</p>

<p>
If your cursor is on a citation link, or at the end of the link, you can run the command again to append new citations to the link. The new entries are separated by commas. The links are clickable, and when you click on them you will see a message in the minibuffer with the citation, and options to open the entry, open a pdf (if you have it), open the url (if the entry has one), or to open notes about the entry. You get this menu for the entry that you clicked on.
</p>

<p>
If you want a different type of citation, type C-u C-c ]. You will be prompted for a format, and you can choose a different type of link format. Most bibtex formats are supported, and some biblatex formats are supported.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Basic usage for references</h2>
<div class="outline-text-2" id="text-3">
<p>
The other use of org-ref is for references to labels in your document. You can put labels in figure and table captions, and then reference them in your document. The label link is clickable, and when you click on it there will be a message in the minibuffer telling you how many labels of that name were found (it should be one).
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> An uninteresting table. <pre>ref:tab-boring</pre> </caption>

<colgroup>
<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="right">0</td>
<td class="right">3</td>
</tr>

<tr>
<td class="right">4</td>
<td class="right">7</td>
</tr>
</tbody>
</table>

<p>
You can then refer to Table <pre>eqref:eq-exp</pre> . The ref links are also clickable, and they take you to the spot where the label is defined. You can enter ref links with completion. Press C-c C-l, type ref, press enter, and then press tab. You will get a list of the labels defined in the buffer you can choose from. There are many things you can make a ref to including a tblname, a label link, an explicit \label{}, and an org-mode #+label: line.
</p>

<p>
There is an eqref link that is used for equations. You must use LaTeX labels in the equation for this.
</p>

<p>
\[e^x = 4 \label{eq-exp} \]
</p>

<p>
You can see in <pre>list-of-tables:lot</pre> the problem to solve.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Miscellaneous links</h2>
<div class="outline-text-2" id="text-4">
<p>
There are two link types for generating a LateX list of tables and list of figures. These links are clickable, and they open a temporary buffer with a list of the tables or figures that you can click on. They export to \listoftables and \listoffigures
</p>

<p>

</p>

<p>

</p>

<p>
You can run these as commands, <pre>list-of-figures:lof</pre> and <pre>elisp:org-ref-list-of-tables</pre> if you do not want a list of those things in your exported document.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Customization</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Default bibliography, pdf directory,</h3>
<div class="outline-text-3" id="text-5-1">
<p>
This is an optional configuration, but it is handy to define a default bibliography so that you can add citations to an org-file without defining a bibliography link. I store all pdfs of bibtex entries in the directory defined by org-ref-pdf-directory, and by the name of the bibtex entry label. This enables org-ref to open the pdf if it can find it. The notes file is optional, I create org-entries for each bibtex entry, which I have experimented with various ways of organizing them with tags, and in topical headings.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-ref-bibliography-notes "~/Dropbox/bibliography/notes.org"
      org-ref-default-bibliography '("~/Dropbox/bibliography/references.bib")
      org-ref-pdf-directory "~/Dropbox/bibliography/bibtex-pdfs/")
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> New key binding</h3>
<div class="outline-text-3" id="text-5-2">
<p>
The default key binding to insert a citation is C-c ]. I chose that because I do not like pressing shift to get ). However, this key binding usurps an org-mode agenda file command. To change this, set this variable
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-ref-insert-cite-key "C-c )")
</pre>
</div>

<ul class="org-ul">
<li>You may have to restart emacs to get C-c ] back.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Default link type</h3>
<div class="outline-text-3" id="text-5-3">
<p>
If you use another citation type alot, you may change the default link type. For example, you may prefer autocite links by default. Just set it like this:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-ref-default-citation-link "autocite")
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> New citation types</h3>
<div class="outline-text-3" id="text-5-4">
<p>
There are so many citation types between bibtex and biblatex. I did not try to add them all. You can add new citation links yourself in your init file. Here, we add a new cite link called citez, and assign a reftex menu key of z to it. This function automatically adds the new link to org-mode, with the citation menu functionality, creates the completion function, and adds the citation to the list of known types.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(org-ref-define-citation-link "citez" ?z)
</pre>
</div>

<p>
It is assumed that this will be exported as \citez[optional stuff]{label}. If you need more flexibility than that, you will have to define everything manually.
</p>

<p>
For example, the original cite link was defined like this.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun org-ref-cite-link-format (keyword desc format)
   (cond
    ((eq format 'html) (format "(&lt;cite&gt;%s&lt;/cite&gt;)" path))
    ((eq format 'latex)
     (concat "\\cite" (when desc (format "[%s]" desc)) "{"
	     (mapconcat (lambda (key) key) (org-ref-split-and-strip-string keyword) ",")
	     "}"))))

(org-add-link-type
 "cite"
 'org-ref-cite-onclick-minibuffer-menu ;; clicking function
 'org-ref-cite-link-format) ;; formatting function
</pre>
</div>

<p>
You should also add your new citation type to the list of org-ref-cite-types.
</p>
</div>
</div>
</div>


<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Summary</h2>
<div class="outline-text-2" id="text-6">
<p>
This covers most of the basic org-ref functionality. There are also several utility functions for interacting with org-buffers and bibtex files that will be described later.
</p>


<p>

</p>
</div>
</div>
<p>Copyright (C) 2014 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2014/05/13/Using-org-ref-for-citations-and-references.org">org-mode source</a><p><p>Org-mode version = 8.2.6</p>